{
  "708b3dc96f6cbe5ecb23d9477309b3b2": {
    "product_name": "Behkiuoda Women Flat Sandals Low Heel Anti Skidding Beach Shoes Cross Strap Peep Toe Sandals",
    "summary": "Overall, customers find the Behkiuoda Women Flat Sandals to be well-made and attractive. However, a notable downside is that sizing issues are common, leading some users to receive sandals that don't fit properly.",
    "created_at": "2025-05-27T07:26:40.526468",
    "last_accessed": "2025-05-27T07:26:49.026938"
  },
  "3adaead7718cba147344dbe7c77a7c14": {
    "product_name": "BRONAX House Slippers for Women Comfy Anti-Slip Soft Plush Female Pantunflas Para Mujer Flexible Indoor Fuzzy Flats Home Shoes Washable Winter Warm Close Toe Ladies Black",
    "summary": "Overall, users really love the BRONAX House Slippers for their exceptional comfort and breathability, making them ideal for indoor wear. Many appreciate their sturdy build and flexibility, with one reviewer noting their suitability for colder weather when paired with socks. However, some users mention that while they hold up well for daily use, there’s a slight concern about longevity, suggesting they may need replacing after a few months.",
    "created_at": "2025-05-27T07:26:43.592824",
    "last_accessed": "2025-05-27T07:26:43.592824"
  },
  "807bc04fea5d186ad6c539873ebaac6d": {
    "product_name": "Orthofeet Innovative Plantar Fasciitis Shoes for Women, Ideal for Heel Pain Relief. Therapeutic Walking Shoes with Arch Support, Arch Booster, Cushioning Ergonomic Sole & Extended Widths- Lake Charles",
    "summary": "Overall, users overwhelmingly praise the Orthofeet Innovative Plantar Fasciitis Shoes for their comfort and good fit, making them especially suitable for those with foot issues like Plantar Fasciitis and RA. Many appreciate the customization options with additional liners and the stylish design. However, some reviewers found the material to feel stiff and plastic-like, leading to uncomfortable tightness, particularly across the ball of the foot, and noted insufficient support for some foot types.",
    "created_at": "2025-05-27T07:26:46.304990",
    "last_accessed": "2025-05-27T07:26:46.304990"
  },
  "248fae2eb7eacfcc43f2900c54bb6c91": {
    "product_name": "Christian Shirts for Women - Way Maker Miracle Worker Light in The Darkness - Vintage Letter Print Prayer T-Shirt",
    "summary": "The \"Christian Shirts for Women - Way Maker Miracle Worker\" has received mixed feedback from customers. Positively, many users loved the design, comfort, and color, highlighting it as a great purchase. However, recurring complaints point to sizing issues, with numerous customers noting that the shirts run small and shrink significantly after washing, leading to disappointment. Additionally, some mentioned long delivery times and concerns about the quality after a few washes.",
    "created_at": "2025-05-27T07:26:49.019090",
    "last_accessed": "2025-05-27T07:26:49.019090"
  },
  "3efe77acc1d6afbdbd471004d551c8e6": {
    "product_name": "Gravity Defyer Proven Pain Relief Women's G-Defy Ion Athletic Shoes for Knee Pain",
    "summary": "Overall, the Gravity Defyer G-Defy shoes receive mixed feedback. Many users praise them for their comfort and pain relief, noting significant improvements for conditions like plantar fasciitis and knee pain, making them ideal for long days on their feet. However, several reviews highlight serious quality concerns, with complaints about the shoes ripping or not fitting as expected, plus issues like narrow toe boxes and difficulty with the tongue design. Despite their high price, some feel they do not offer the expected durability.",
    "created_at": "2025-05-27T07:26:52.191584",
    "last_accessed": "2025-05-27T07:26:52.191584"
  },
  "91c488d38b464056345191f5930d24f0": {
    "product_name": "Start Women Summer Flip Flops Sandals Indoor Homewear Beach Slipper",
    "summary": "Overall, customers are very pleased with the Start Women Summer Flip Flops, praising them as a great value for the price. However, there are no significant negative reviews mentioned, indicating a strong consensus on their quality and affordability.",
    "created_at": "2025-05-27T07:34:13.128594",
    "last_accessed": "2025-05-27T07:34:13.128594"
  },
  "6e20779dc3ac6c77de213ed1e1894117": {
    "product_name": "Ladies Flip Flops Casual Ladies Sandals Slim Waterproof Summer Beach Slippers Shower Slippers Comfortable Non-Slip Soles Ladies Slim Flip Flops",
    "summary": "Overall, customers find these flip flops very comfortable and appreciate their excellent value for the price. However, a common issue is that they run small, with some needing to order a size up to find the right fit. Despite this sizing challenge, many recommend the sandals for their quality and comfort.",
    "created_at": "2025-05-27T07:34:15.599294",
    "last_accessed": "2025-05-27T07:34:15.599294"
  },
  "49ea3b4c9463a2fff6ae8842a93c5a3a": {
    "product_name": "Womens Rhinestone Flat Sandals Casual Summer Thong Sandals Lightweight T-Strap Flip Flops Comfortable Walking Beach Shoes Cute Bridal Dress Shoes with Padded Insole",
    "summary": "Overall, users appreciate the comfort and padding of these sandals, making them suitable for casual wear and beach outings. However, a recurring issue is the sizing, with many finding the straps too loose, leading to discomfort and blisters during prolonged use, especially for formal occasions like weddings.",
    "created_at": "2025-05-27T07:34:17.382974",
    "last_accessed": "2025-05-27T07:34:17.382974"
  },
  "eca27a5a814681c6ec7e1106c798a650": {
    "product_name": "Amiley Women Sandals Summer, Women Solid Color Ruffles Round Toe Flat Heel Cross Tied Sandals Rome Shoes (Red, 8.5)",
    "summary": "The Amiley Women Sandals received mixed reviews, with many users loving the cute design but expressing frustration over sizing issues. A common complaint is that the sandals run a half size too big and feel cheaply made, leading some customers to feel very dissatisfied and even give the shoes away.",
    "created_at": "2025-05-27T07:34:19.270470",
    "last_accessed": "2025-05-27T07:34:19.270470"
  },
  "555c5d0b6c4c6ea254724a94f1fb5add": {
    "product_name": "Ataiwee Women's Flat Sandals - Double Bands Cross Front Strappy Slip on Spring Summer Shoes.(1908041-3,YB/PU,10)",
    "summary": "The Ataiwee Women's Flat Sandals have received predominantly negative feedback, with users consistently highlighting the poor quality and cheap appearance of the shoes. Many reviewers express disappointment, suggesting that the product does not meet their expectations for durability and style.",
    "created_at": "2025-05-27T07:34:20.655867",
    "last_accessed": "2025-05-27T07:34:20.655867"
  },
  "924942794c4c716676f3660ebbde25f2": {
    "product_name": "Wollanlily Womens Bohemian Flat Sandals T-Strap Elastic Beach Wear Flip Flops Summer Casual Shoes(8 B(M) US,Apricot)",
    "summary": "Overall, customers love the Wollanlily Women's Bohemian Flat Sandals for their cute design and unbeatable price. Initially, some found them uncomfortable between the toes for the first couple of days, but many reported that they softened up quickly and became their favorite sandals.",
    "created_at": "2025-05-27T07:34:22.127321",
    "last_accessed": "2025-05-27T07:34:22.127321"
  },
  "6ec97c65ab31cc6556d1219d97219e0c": {
    "product_name": "MD Sports Easy Assembly 48 Inch Air Powered Hockey Table, Space-Saving Design, Foldable Legs",
    "summary": "Overall, customers are highly disappointed with the MD Sports Easy Assembly Air Powered Hockey Table. Many reports indicate that the item sent is not what was expected, with issues like it not being foldable as described and poor airflow affecting gameplay. This has led to significant dissatisfaction, especially when it comes to gifting occasions.",
    "created_at": "2025-05-27T14:32:46.040101",
    "last_accessed": "2025-05-27T14:44:17.219307"
  },
  "743f299e5cad72613f10f7d221cdce75": {
    "product_name": "YEOREO Women High Waist Workout Gym Smile Contour Seamless Leggings Yoga Pants Tights Orange M",
    "summary": "The YEOREO Women High Waist Workout Leggings receive strong criticism for their poor fit and see-through material. Many users report that they run small and are not squat-proof, leading to significant discomfort during workouts. However, some appreciated the soft fabric and found them cute for casual wear, though they advised sizing up. Overall, these leggings may not meet the expectations for active use, especially for leg days.",
    "created_at": "2025-05-27T14:32:48.608797",
    "last_accessed": "2025-05-27T14:32:48.608797"
  },
  "55fac81a6aba967e1b6c37d2005d0b41": {
    "product_name": "SATINIOR Women's Elegant Ruched Knee Length Skirt Slim Fit Office Pencil Skirt (Green, M)",
    "summary": "Overall, customers found the SATINIOR Women's Elegant Ruched Knee Length Skirt visually appealing, but many were disappointed with the quality, citing it as poor and not worth the price. One reviewer specifically mentioned they would not recommend the item due to these concerns.",
    "created_at": "2025-05-27T14:32:50.581977",
    "last_accessed": "2025-05-27T14:34:24.573387"
  },
  "1910c5ac6c7db2cda656e2f1d122d1de": {
    "product_name": "Women's Comfort Fit Straight Pants Office Casual Business Wear Black XXL",
    "summary": "Overall, users appreciate the comfort of the Women's Comfort Fit Straight Pants, making them suitable for office wear. However, multiple complaints highlight a significant issue with the zipper quality, with reports of it ripping easily and failing to reattach properly. This has led to disappointment among customers regarding the durability of the product.",
    "created_at": "2025-05-27T14:32:52.323758",
    "last_accessed": "2025-05-27T14:32:52.323758"
  },
  "4d087bad934845cd840abb0e3b63e421": {
    "product_name": "ORISTACO Steel Toe Work Shoes, Comfortable Casual Lightweight Slip on Slip Resistant Industrial Construction Sneakers, 832 Black 47",
    "summary": "The ORISTACO Steel Toe Work Shoes have received praise for their comfort and cooling features, making them ideal for those who spend long hours on their feet, like roof inspectors. However, some users encountered issues, with at least one person needing to return the shoes, indicating potential sizing or fit problems.",
    "created_at": "2025-05-27T14:32:53.851804",
    "last_accessed": "2025-05-27T14:34:23.031697"
  },
  "bbd8f98c6d4e66a8139f6befc22872ce": {
    "product_name": "Women's Stretchy Slim Fit Midi Pencil Skirt for Office Wear Black Size XL BP557-1",
    "summary": "Customers love the Women's Stretchy Slim Fit Midi Pencil Skirt for its comfortable and flattering stretchable material that fits nicely. There are no notable complaints or negative feedback, indicating a strong overall satisfaction with the product.",
    "created_at": "2025-05-27T14:32:55.136428",
    "last_accessed": "2025-05-27T14:32:55.136428"
  },
  "e1846a8499db65c85d2cde63d0ad02bf": {
    "product_name": "LED Plant Grow Lights, Desk Plant Grow Light with Timer, RGB Plant Light Full Spectrum for Indoor Plants, Eye-Care Table Lamp for Plant Grow, Reading",
    "summary": "The LED Plant Grow Light is well-received as a cute and functional addition to office spaces, effectively serving both as a plant light and a stylish desk lamp. However, specific feedback on its growing capabilities or any potential drawbacks was not highlighted, indicating users primarily appreciate its aesthetic and secondary utility rather than its performance as a grow light.",
    "created_at": "2025-05-27T14:34:23.019525",
    "last_accessed": "2025-05-27T14:34:23.019525"
  },
  "7c6446f8777741398bd91a9e4fa40dd1": {
    "product_name": "Eyekepper Retro Vintage Flex Lightweight Plastic Round Frame Computer Glasses Readers Eyeglasses (Grey Tortoise Shell, Yellow Tinted Lenses)",
    "summary": "Overall, the Eyekepper Retro Vintage Flex Lightweight Eyeglasses have received mixed feedback. Many users appreciate their stylish design and report relief from headaches and eye fatigue after prolonged computer use. However, significant concerns were raised about the lens quality, with one user experiencing color changes and chipping within just two days.",
    "created_at": "2025-05-27T14:34:24.556169",
    "last_accessed": "2025-05-27T14:34:24.556169"
  },
  "7330f3262957107b88fb24bb15e700ef": {
    "product_name": "Alfani Womens Bi-Stretch Casual Trouser Pants",
    "summary": "The Alfani Women's Bi-Stretch Casual Trouser Pants receive mixed feedback from users. Many appreciate their great quality and comfort; however, a notable concern is that the pants tend to lose their shape after wear, leading to a loose and sloppy look. Additionally, some customers noted the fit runs large, and the length can be excessive, requiring alterations for the best fit.",
    "created_at": "2025-05-27T14:34:26.881247",
    "last_accessed": "2025-05-27T14:34:26.881247"
  },
  "4629e8d3379886acac372047733f6920": {
    "product_name": "Ergodyne Chill-Its 6609 Terry Sweatband - Gray - Pack 12",
    "summary": "The Ergodyne Chill-Its 6609 Terry Sweatband receives consistently positive feedback, with users praising its high quality, comfort, and durability even after multiple washes. However, there are no significant negative comments reported, making it a reliable choice for those in need of effective sweatbands.",
    "created_at": "2025-05-27T14:34:28.840485",
    "last_accessed": "2025-05-27T14:34:28.840485"
  },
  "3e91dc20cb6dcb814662d34f19858d29": {
    "product_name": "Sports Bra for Women Medium Support Cross-Back Yoga Bras Removable Pad Color Black Blue Red Size M",
    "summary": "The Sports Bra for Women has received overwhelmingly positive feedback, with users praising its comfortable fit, medium support, and stylish design. Many appreciated that it runs true to size, although a few found it slightly tight and recommended sizing up. On the downside, some reviews mentioned issues with the removable padding, stating it was either difficult to adjust or unnecessary, which detracted from their overall satisfaction.",
    "created_at": "2025-05-27T14:44:10.174972",
    "last_accessed": "2025-05-27T14:44:10.174972"
  },
  "653dac4750eaad033b825e50a4ce9953": {
    "product_name": "Leonisa Women's Minimizer Wireless Lace Posture Back Support Bra Front Closure Black",
    "summary": "The Leonisa Women's Minimizer Wireless Lace Posture Back Support Bra has received largely negative feedback, particularly regarding its sizing. Many customers, including one who typically wears a 38-40 C or D cup, found the bra to run significantly smaller than expected, with rigid materials offering no stretch. Users reported frustration with the sizing inconsistency and stiffness, leading to multiple returns without plans to reorder.",
    "created_at": "2025-05-27T14:44:12.387833",
    "last_accessed": "2025-05-27T14:44:12.387833"
  },
  "434da52b2686a221251d8728512aaebf": {
    "product_name": "Knit-Rite Lightweight Torso V-Neck Double Flap",
    "summary": "Overall, the Knit-Rite Lightweight Torso V-Neck Double Flap is appreciated for its soft material and effectiveness in providing comfort under scoliosis braces, making it a popular choice among parents of children with such needs. However, several users noted that the sizing runs small, with some experiencing difficulties fitting even after sizing up. Additionally, a strong perfume scent upon arrival was a significant issue for those sensitive to fragrances, leading to extra hassle before use.",
    "created_at": "2025-05-27T14:44:14.965413",
    "last_accessed": "2025-05-27T14:44:14.965413"
  },
  "4883694919db60e48cfa2fd272cb6c16": {
    "product_name": "Front Closure Back Smoothing Bras Seamless Mesh Lace Bras for Women Post Surgery Sleep Leisure Full Coverage Wirefree Padded Support Lift Push Up Comfortable Bralettes Plus Size (376 Black, 2XL, xx_l)",
    "summary": "The Front Closure Back Smoothing Bra has mixed reviews, with users praising its comfort and flattering fit, while many are disappointed by its lack of support and sizing issues. Notably, some customers returned the bra due to poor craftsmanship, highlighting concerns over durability. Overall, it seems ideal for leisure use but may not satisfy those needing more robust support.",
    "created_at": "2025-05-27T14:44:17.209081",
    "last_accessed": "2025-05-27T14:44:17.209081"
  },
  "565f11f78f892538b40b11b018530c09": {
    "product_name": "BAOMOSI Racerback Sports Bras Padded Seamless High Impact Support for Yoga Gym Workout Fitness Black M",
    "summary": "The BAOMOSI Racerback Sports Bra receives high praise for its excellent fit and reliable support during workouts. Users love that it provides high-impact support, making it a favorite for yoga and gym sessions. However, there are no negative reviews mentioned, suggesting a strong overall satisfaction with the product.",
    "created_at": "2025-05-27T14:44:18.847201",
    "last_accessed": "2025-05-27T14:44:18.847201"
  },
  "dfa5ddc70614b0210af2d1631457a539": {
    "product_name": "Megadream Foldable Mobile Phone Holder Cellphone Clamp Smartphone Clip Compatible with Microsoft Xbox One/Xbox One S/Xbox One X, SteelSeries Stratus XL/Nimbus, Steam Controllers, with Analog Stick Cap",
    "summary": "The Megadream Foldable Mobile Phone Holder generally receives positive feedback for its snug fit and affordability, especially for gaming on x-cloud. However, users have noted concerns about its durability, with mentions of brittle plastic that may snap, and compatibility issues with rechargeable battery packs. Overall, it's a budget-friendly option but may require careful handling.",
    "created_at": "2025-05-27T14:46:00.256013",
    "last_accessed": "2025-05-27T14:46:00.256013"
  },
  "87c7deaa92be4fe01ab833d2771ca0ac": {
    "product_name": "Nepest Women’s Basic V-Neck T Shirts Long Sleeve Casual Solid Soft Tops, Loose Fit & Stretchy, Navy Large",
    "summary": "Based on user feedback, the Nepest Women’s Basic V-Neck T-Shirts have received positive remarks for their softness, comfortable fit, and stylish design, making them a favorite for casual wear. However, some customers reported issues with sizing inconsistencies and pilling after washing, which detracted from their overall satisfaction.",
    "created_at": "2025-05-27T14:50:41.205280",
    "last_accessed": "2025-05-27T14:50:41.205280"
  },
  "bf942da445422f7e4e24ba995e8149e3": {
    "product_name": "Womens Henley Shirts Fall V Neck Button Long Sleeve Loose Casual Knit Sweaters Tops Black",
    "summary": "Overall, customers appreciate the comfort and warmth of the Women's Henley Shirts, noting they're easy to wear. However, a common concern is that the fabric is not very soft, which may impact some users' enjoyment of the shirt.",
    "created_at": "2025-05-27T14:50:42.554727",
    "last_accessed": "2025-05-27T14:52:33.954307"
  },
  "4f205fce6039cf030f4137d08e50c20f": {
    "product_name": "Women's Chiffon Elbow Sleeve Scoop Neck Pleated Blouse Tops, Black, Large",
    "summary": "Overall, customers are thrilled with the Women's Chiffon Elbow Sleeve Blouse, praising its flattering fit and good quality. Many plan to purchase additional colors. There are no notable negative comments, indicating high satisfaction with the product.",
    "created_at": "2025-05-27T14:50:43.738924",
    "last_accessed": "2025-05-27T14:52:33.954307"
  },
  "3489ffe9c61763d4a01ad848532b0e94": {
    "product_name": "IVVIC Women's Short Sleeve A-Line Solid Color Casual Dress with Pockets Navyblue",
    "summary": "The IVVIC Women's Short Sleeve A-Line Casual Dress is largely praised for its comfort and flattering A-line shape, making it a great choice for summer wear. Customers love the lightweight, stretchy fabric and the unique uneven hemline, along with the convenience of pockets. However, some feedback suggests that the length may not be ideal for more mature women, as a longer front would provide better knee coverage.",
    "created_at": "2025-05-27T14:50:46.838167",
    "last_accessed": "2025-05-27T14:50:46.838167"
  },
  "85b9b7f07abeccffc6939beed278462b": {
    "product_name": "Miusol Women's Official V Neck Crossover Design Cap Sleeve Fitted Pencil Dress Navy Blue",
    "summary": "The Miusol Women's V Neck Crossover Pencil Dress generally receives positive feedback for its great fit and stretchy, comfortable material. Many users recommend sizing up for a better fit, as some found it snug, especially around the waist. While the dress is praised for being professional enough for work occasions, a few reviewers expressed concern about the neckline being slightly low. Overall, this dress is viewed as a great value and flattering option for various events.",
    "created_at": "2025-05-27T14:50:49.094198",
    "last_accessed": "2025-05-27T14:50:49.094198"
  },
  "b3680bc54b1de2e13ec68cfc12a7782e": {
    "product_name": "Women's Summer Sleeveless Shirts Sexy V Neck Flowy Pleated Tunic Tank Tops 2X Black",
    "summary": "This Women's Summer Sleeveless Shirt receives praise for its softness and versatility, making it ideal for various occasions. However, there are no notable negative feedbacks mentioned, indicating a generally positive reception among users.",
    "created_at": "2025-05-27T14:50:50.689054",
    "last_accessed": "2025-05-27T14:52:33.954307"
  },
  "bf833764962cab4e7b67b02973897b1c": {
    "product_name": "Berryou Women's Basic V Neck Tank Tops Casual Loose Sleeveless Blouse T Shirts with Pocket Burgundy XL",
    "summary": "This Berryou V-neck tank top is highly praised for its modest design and comfortable fit, making it a favorite among those seeking stylish yet appropriate attire. Users loved that it washes well without shrinking or fading and provides good coverage. However, there are no notable negative feedbacks noted in the reviews, indicating strong overall satisfaction with the product.",
    "created_at": "2025-05-27T14:52:35.689985",
    "last_accessed": "2025-05-27T14:52:35.689985"
  }
}